artillery/test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
    - duration: 60
      arrivalRate: 10
      rampTo: 200
    - duration: 300
      rampTo: 50
payload:
    # path is relative to the location of the test script
    path: "./ids.csv"
    fields:
      - "id"
scenarios:
  - name: products
    flow:
      - get:
          url: "/products"
      - get:
          url: "/products/{{ id }}/styles"
      - get:
          url: "/products/{{ id }}/related"